jmeters/MIS_LOGIN_TO_SEARCHDB-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: MIS_LOGIN_TO_SEARCHDB-Selenium
  blazegrid: true
  
  capabilites: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: MIS_LOGIN_TO_SEARCHDB-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  MIS_LOGIN_TO_SEARCHDB-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:8080/)
      - clickByID(name)
      - typeByID(name): "admin@dc.com"
      - typeByID(pwd): "admin1010"
      - clickByID(confirm_user)
      - clickByLinkText(Search)
      - clickByID(movieTitle)
      - typeByID(movieTitle): "Titanic"
      - clickByID(confirm_movie)

  MIS_LOGIN_TO_SEARCHDB-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/73.0.3683.86 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/login'
            method: POST
            label: 'http://localhost:8080/login'
            think-time: 0ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              email: admin@dc.com
              password: admin1010
          - url: 'http://localhost:8080/searchMovie'
            method: GET
            label: 'http://localhost:8080/searchMovie'
            think-time: 3456ms
            headers: {}
          - url: 'http://localhost:8080/searchMovieResult'
            method: POST
            label: 'http://localhost:8080/searchMovieResult'
            think-time: 7682ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              id: '0'
              movieArtist: ''
              movieTitle: Titanic