jmeters/MIS_Login_To_MoVIE_SEARCH-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: MIS_Login_To_MoVIE_SEARCH-Selenium
  blazegrid: true
  
  capabilites: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: MIS_Login_To_MoVIE_SEARCH-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  MIS_Login_To_MoVIE_SEARCH-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:8080/)
      - clickByLinkText(here)
      - clickByID(name)
      - clickByID(name)
      - clickByID(name)
      - doubleClickByID(name)
      - typeByID(name): "Balze"
      - clickByID(pwd)
      - typeByID(pwd): "admin1010"
      - clickByID(email)
      - typeByID(email): "Balze@dc.com"
      - typeByID(phone): "123-234-0000"
      - clickByID(confirm_user)
      - clickByLinkText(here)
      - clickByLinkText(Search)
      - clickByID(movieTitle)
      - clickByID(movieArtist)
      - typeByID(movieArtist): "Jame Cameron"
      - clickByID(confirm_movie)
      - clickByID(movieTitle)
      - clickByID(movieArtist)
      - typeByID(movieArtist): "James Cameron"
      - clickByID(confirm_movie)

  MIS_Login_To_MoVIE_SEARCH-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/73.0.3683.86 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/addUser'
            method: GET
            label: 'http://localhost:8080/addUser'
            think-time: 0ms
            headers: {}
          - url: 'http://localhost:8080/saveUser'
            method: POST
            label: 'http://localhost:8080/saveUser'
            think-time: 32705ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              email: Balze@dc.com
              id: '0'
              name: Balze
              password: admin1010
              phone: 123-234-0000
          - url: 'http://localhost:8080/home'
            method: GET
            label: 'http://localhost:8080/home'
            think-time: 2520ms
            headers: {}
          - url: 'http://localhost:8080/searchMovie'
            method: GET
            label: 'http://localhost:8080/searchMovie'
            think-time: 6549ms
            headers: {}
          - url: 'http://localhost:8080/searchMovieResult'
            method: POST
            label: 'http://localhost:8080/searchMovieResult'
            think-time: 12232ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              id: '0'
              movieArtist: Jame Cameron
              movieTitle: ''
          - url: 'http://localhost:8080/searchMovie'
            method: GET
            label: 'http://localhost:8080/searchMovie'
            think-time: 5741ms
            headers: {}
          - url: 'http://localhost:8080/searchMovieResult'
            method: POST
            label: 'http://localhost:8080/searchMovieResult'
            think-time: 5673ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              id: '0'
              movieArtist: James Cameron
              movieTitle: ''