jmeters/MIS_Login_To_ROLE-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: MIS_Login_To_ROLE-Selenium
  blazegrid: true
  
  capabilites: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: MIS_Login_To_ROLE-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  MIS_Login_To_ROLE-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:8080/)
      - typeByID(name): "admin@dc.com"
      - typeByID(pwd): "admin1010"
      - clickByXPath(//form[@id='user_form']/div[3])
      - clickByID(confirm_user)
      - clickByLinkText(Admin)
      - clickByXPath((//a[contains(text(),'Assign a new role')])[6])
      - selectByID(role): "Movie Database Administrator"
      - clickByCSS(option[value="Movie Database Administrator"])
      - selectByID(role): "Administrator"
      - clickByCSS(option[value="Administrator"])
      - clickByID(confirm_user)

  MIS_Login_To_ROLE-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/73.0.3683.86 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/login'
            method: POST
            label: 'http://localhost:8080/login'
            think-time: 0ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              email: admin@dc.com
              password: admin1010
          - url: 'http://localhost:8080/listRole'
            method: GET
            label: 'http://localhost:8080/listRole'
            think-time: 11290ms
            headers: {}
          - url: 'http://localhost:8080/editRole'
            method: GET
            label: 'http://localhost:8080/editRole'
            think-time: 5229ms
            headers: {}
            body:
              id: '39'
          - url: 'http://localhost:8080/saveRole'
            method: POST
            label: 'http://localhost:8080/saveRole'
            think-time: 3845ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              email: Balze@dc.com
              id: '39'
              name: Balze
              password: admin1010
              phone: 123-234-0000
              role: Administrator
          - url: 'http://localhost:8080/listRole'
            method: GET
            label: 'http://localhost:8080/listRole'
            think-time: 43ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded