jmeters/MIS_MOVIE_REG_TO_List-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: MIS_MOVIE_REG_TO_List-Selenium
  blazegrid: true
  
  capabilites: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: MIS_MOVIE_REG_TO_List-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  MIS_MOVIE_REG_TO_List-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:8080/)
      - clickByID(name)
      - typeByID(name): "ankit@dc.com"
      - typeByID(pwd): "admin1010"
      - clickByID(confirm_user)
      - clickByLinkText(Movie Database)
      - clickByID(movieTitle)
      - typeByID(movieTitle): "Terminator"
      - typeByID(movieArtist): "James Cameron"
      - typeByID(year): "1984"
      - typeByID(description): "Searching John corner"
      - clickByID(confirm_movie)
      - clickByLinkText(here)
      - clickByLinkText(Movie List)
      - clickByLinkText(Search)
      - clickByID(movieTitle)
      - typeByID(movieArtist): "James Cameron"
      - clickByID(confirm_movie)

  MIS_MOVIE_REG_TO_List-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/73.0.3683.86 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/login'
            method: POST
            label: 'http://localhost:8080/login'
            think-time: 0ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              email: ankit@dc.com
              password: admin1010
          - url: 'http://localhost:8080/addMovie'
            method: GET
            label: 'http://localhost:8080/addMovie'
            think-time: 2655ms
            headers: {}
          - url: 'http://localhost:8080/saveMovie'
            method: POST
            label: 'http://localhost:8080/saveMovie'
            think-time: 29837ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              description: Searching John corner
              id: '0'
              movieArtist: James Cameron
              movieTitle: Terminator
              year: '1984'
          - url: 'http://localhost:8080/home'
            method: GET
            label: 'http://localhost:8080/home'
            think-time: 2350ms
            headers: {}
          - url: 'http://localhost:8080/listMovie'
            method: GET
            label: 'http://localhost:8080/listMovie'
            think-time: 3619ms
            headers: {}
          - url: 'http://localhost:8080/searchMovie'
            method: GET
            label: 'http://localhost:8080/searchMovie'
            think-time: 2580ms
            headers: {}
          - url: 'http://localhost:8080/searchMovieResult'
            method: POST
            label: 'http://localhost:8080/searchMovieResult'
            think-time: 13578ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              id: '0'
              movieArtist: James Cameron
              movieTitle: ''